In [1]:
import sqlite3

In [23]:
conn = sqlite3.connect('INSTRUCTOR.db')

In [3]:
cursor_obj = conn.cursor()

In [4]:
cursor_obj.execute('DROP TABLE IF EXISTS Instructor')

<h2><i><b>Creating table query</b></i></h2>
<p>Create a table query and call it to the cursor and excute it</p>

In [19]:
table = """CREATE TABLE IF NOT EXISTS Instructor (
                    id INTEGER PRIMARY KEY NOT NULL,
                    fname VARCHAR(20),
                    lname VARCHAR(20),
                    city VACHAR(20),
                    code CHAR(2)
                    )"""
cursor_obj.execute(table)
print("Table is ready")

Table is ready

<p><b><i>Inserting data into table</i></b></p>

In [8]:
cursor_obj.execute('''INSERT INTO Instructor VALUES (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

<h2><i><b>Query the data</b></i></h2>
<p><i>Fetch all data from the table</i></p>

In [31]:
statement = '''SELECT * FROM Instructor'''
cursor_obj.execute(statement)

print("All Data")
output_all = cursor_obj.fetchall()

for observation in output_all:
    print(observation)

All Data
(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

<h2><i><b>Fetch some of the rows</b></i></h2>
<p><i>Limiting the number of rows being retrieved</i></p>

In [32]:
cursor_obj.execute('''SELECT * FROM Instructor''')
output_many = cursor_obj.fetchmany(2)
for row_many in output_many:
    print(row_many)

(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [33]:
#Fetch only fname from the table
cursor_obj.execute('''SELECT fname FROM INSTRUCTOR''')
print('All the data')
output_colum = cursor_obj.fetchall()

for col in output_colum:
    print(col)

All the data
('Rav',)
('Raul',)
('Hima',)

<p><i>Update columns in query</i></p>

In [38]:
query_update = '''UPDATE Instructor SET city = 'MOOSETOWN' WHERE fname="Rav"'''
cursor_obj.execute(query_update)

In [43]:
cursor_obj.execute('''SELECT * FROM Instructor''')

output1 = cursor_obj.fetchall()
for item in output1:
    print(item)

(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [36]:
import pandas as pd

In [40]:
df = pd.read_sql_query("SELECT * FROM Instructor;", conn)
df

Empty DataFrame
Columns: [id, fname, lname, city, code]
Index: []

In [42]:
df.shape

(0, 5)

In [41]:
conn.close()